public class gayatri_ramayana {
    public static void main(String[] args) {
        System.out.println("                       Gayatri Ramayana\n");
        System.out.print("It's a software which decodes the Ramayana composed by Valmiki Ji\n"+
                "This software takes the first letter of the first word in each of the 1000th shloka\n"+
                "mentioned in the Valmiki Ramayana which has a total of 24000 shlokas in it.\n"+
                "Once it collected all the 24 letters from each of the 1000th shlokas, it concatenates\n"+
                "all the 24 letters of hindi and gives you the Gayatri Mantra in the end as an output.\n"+
                "gayatri Mantra is considered to be the most powerful mantra in the whole world\n");

        System.out.println("Each 1000th shloka from the 24000 shlokas are mentioned below.\n");
        System.out.println("1. तपस्स्वाध्यायनिरतं तपस्वी वाग्विदां वरम्।\n" +
                "   नारदं परिपप्रच्छ वाल्मीकिर्मुनिपुङ्गवम् ॥ ");
        System.out.println("2. स हत्वा राक्षसान्सर्वान् यज्ञघ्नान् रघुनन्दनः।\n" +
                "   ऋषिभिः पूजितस्सम्यक् यथेन्द्रो विजयी पुरा ॥");
        System.out.println("3. विश्वामित्रस्तु धर्मात्मा श्रुत्वा जनकभाषितम् ।\n" +
                "   वत्स राम धनुः पश्य इति राघवमब्रवीत्  ॥ ");
        System.out.println("4. तुष्टावास्य तदा वंशं  प्रविश्य च विशांपतेः।\n" +
                "   शयनीयं नरेन्द्रस्य तदासाद्य व्यतिष्ठत ॥");
        System.out.println("5. वनवासं हि संख्याय वासांस्याभरणानि च।\n" +
                "   भर्तारमनुगच्छन्त्यै सीतायै श्वशुरो ददौ ॥");
        System.out.println("6. राजा सत्यं च धर्मं च  राजा कुलवतां कुलम्।\n" +
                "   राजा माता पिता चैव राजा हितकरो नृणाम् ॥  ");
        System.out.println("7. निरीक्ष्य स मुहूर्तं तु ददर्श भरतो गुरुम् ।\n" +
                "   उटजे राममासीनं जटामण्डलधारिणम् ॥");
        System.out.println("8. यदि बुद्धिः कृता द्रष्टुं अगस्त्यं तं महामुनिम्।\n" +
                "   अद्यैव गमने बुद्धिं रोचयस्व महायशाः ॥");
        System.out.println("9. भरतस्यार्यपुत्रस्य श्वश्रूणां मम च प्रभो।\n" +
                "   मृगरूपमिदं व्यक्तं विस्मयं जनयिष्यति ॥");
        System.out.println("10. गच्छ शीघ्रमितो राम सुग्रीवं तं महाबलम्।\n" +
                "    वयस्यं तं कुरु क्षिप्रमितो गत्वाद्य राघव ॥ ");
        System.out.println("11. देशकालौ प्रतीक्षस्व क्षममाणः प्रियाप्रिये।\n" +
                "    सुखदुःखसहः काले  सुग्रीववशगो भव ॥");
        System.out.println("12. वन्द्यास्ते तु तपस्सिद्धास्तपसा वीतकल्मषाः\n" +
                "    प्रष्टव्याश्चापि सीतायाः प्रवृत्तिं विनयान्वितैः  ॥ ");
        System.out.println("13. स निर्जित्य पुरीं श्रेष्ठां लङ्कां तां कामरूपिणीम्।\n" +
                "    विक्रमेण महातेजाः हनूमान्मारुतात्मजः ॥");
        System.out.println("14. धन्या देवाः सगन्धर्वाः सिद्धाश्च परमर्षयः ।\n" +
                "    मम पश्यन्ति ये नाथं रामं राजीवलोचनम् ॥");
        System.out.println("15. मंगलाभिमुखी तस्य सा तदासीन्महाकपेः।\n" +
                "    उपतस्थे विशालाक्षी प्रयता हव्यवाहनम् ॥");
        System.out.println("16. हितं महार्थं मृदु हेतुसंहितं व्यतीतकालायतिसंप्रतिक्षमम्।\n" +
                "    निशम्य तद्वाक्यमुपस्थितज्वरः प्रसङ्गवानुत्तरमेतदब्रवीत् ॥");
        System.out.println("17. धर्मात्मा रक्षसां श्रेष्ठः संप्राप्तोऽयं विभीषणः ।\n" +
                "    लङ्कैश्वर्यं ध्रुवं श्रीमानयं प्राप्नोत्यकण्टकम् ॥");
        System.out.println("18. यो वज्रपाताशनिसन्निपातान्न चुक्षुभे नापि चचाल राजा।\n" +
                "    स रामबाणाभिहतो भृशार्तश्चचाल चापं च मुमोच वीरः ॥");
        System.out.println("19. यस्य विक्रममासाद्य राक्षसा निधनं गताः।\n" +
                "    तं मन्ये राघवं वीरं नारायणमनामयम् ।");
        System.out.println("20. न ते ददर्शिरे रामं दहन्तमरिवाहिनीम्।\n" +
                "    मोहिताः परमास्त्रेण गान्धर्वेण महात्मना ॥");
        System.out.println("21. प्रणम्य देवताभ्यश्च ब्राह्मणेभ्यश्च मैथिली ।\n" +
                "    बद्धांजलिपुटाचेदमुवाचाग्निसमीपतः ॥ ");
        System.out.println("22. चलनात्पर्वतेन्द्रस्य गणा देवाश्च कंपिताः। \n" +
                "    चचाल पार्वती चापि तदाश्लिष्टा महेश्वरम् ॥");
        System.out.println("23. दाराः पुत्राः पुरं राष्ट्रं भोगाच्छादनभोजनम्।\n" +
                "    सर्वमेवाविभक्तं नौ भविष्यति हरीश्वर ॥");
        System.out.println("24. यामेव रात्रिं शत्रुघ्नः पर्णशालां समाविशत्।\n" +
                "    तामेव रात्रिं सीतापि प्रसूता दारकद्वयम् ॥");



        String[] input0 = {"तपस्स्वाध्यायनिरतं तपस्वी वाग्विदां वरम्। नारदं परिपप्रच्छ वाल्मीकिर्मुनिपुङ्गवम् ॥ ",
                "स हत्वा राक्षसान्सर्वान् यज्ञघ्नान् रघुनन्दनः। ऋषिभिः पूजितस्सम्यक् यथेन्द्रो विजयी पुरा ॥",
                "विश्वामित्रस्तु धर्मात्मा श्रुत्वा जनकभाषितम् । वत्स राम धनुः पश्य इति राघवमब्रवीत्  ॥",
                "तुष्टावास्य तदा वंशं  प्रविश्य च विशांपतेः। शयनीयं नरेन्द्रस्य तदासाद्य व्यतिष्ठत ॥",
                "वनवासं हि संख्याय वासांस्याभरणानि च। भर्तारमनुगच्छन्त्यै सीतायै श्वशुरो ददौ ॥",
                "राजा सत्यं च धर्मं च  राजा कुलवतां कुलम्। राजा माता पिता चैव राजा हितकरो नृणाम् ॥",
                "निरीक्ष्य स मुहूर्तं तु ददर्श भरतो गुरुम् । उटजे राममासीनं जटामण्डलधारिणम् ॥",
                "यदि बुद्धिः कृता द्रष्टुं अगस्त्यं तं महामुनिम्। अद्यैव गमने बुद्धिं रोचयस्व महायशाः ॥",
                "भरतस्यार्यपुत्रस्य श्वश्रूणां मम च प्रभो। मृगरूपमिदं व्यक्तं विस्मयं जनयिष्यति ॥",
                "गच्छ शीघ्रमितो राम सुग्रीवं तं महाबलम्। वयस्यं तं कुरु क्षिप्रमितो गत्वाद्य राघव ॥",
                "देशकालौ प्रतीक्षस्व क्षममाणः प्रियाप्रिये। सुखदुःखसहः काले  सुग्रीववशगो भव ॥",
                "वन्द्यास्ते तु तपस्सिद्धास्तपसा वीतकल्मषाः। प्रष्टव्याश्चापि सीतायाः प्रवृत्तिं विनयान्वितैः  ॥",
                "स निर्जित्य पुरीं श्रेष्ठां लङ्कां तां कामरूपिणीम्। विक्रमेण महातेजाः हनूमान्मारुतात्मजः ॥",
                "धन्या देवाः सगन्धर्वाः सिद्धाश्च परमर्षयः । मम पश्यन्ति ये नाथं रामं राजीवलोचनम् ॥",
                "मंगलाभिमुखी तस्य सा तदासीन्महाकपेः। उपतस्थे विशालाक्षी प्रयता हव्यवाहनम् ॥",
                "हितं महार्थं मृदु हेतुसंहितं व्यतीतकालायतिसंप्रतिक्षमम्। निशम्य तद्वाक्यमुपस्थितज्वरः प्रसङ्गवानुत्तरमेतदब्रवीत् ॥",
                "धर्मात्मा रक्षसां श्रेष्ठः संप्राप्तोऽयं विभीषणः । लङ्कैश्वर्यं ध्रुवं श्रीमानयं प्राप्नोत्यकण्टकम् ॥",
                "यो वज्रपाताशनिसन्निपातान्न चुक्षुभे नापि चचाल राजा। स रामबाणाभिहतो भृशार्तश्चचाल चापं च मुमोच वीरः ॥",
                "यस्य विक्रममासाद्य राक्षसा निधनं गताः। तं मन्ये राघवं वीरं नारायणमनामयम् । ",
                "न ते ददर्शिरे रामं दहन्तमरिवाहिनीम्। मोहिताः परमास्त्रेण गान्धर्वेण महात्मना ॥",
                "प्रणम्य देवताभ्यश्च ब्राह्मणेभ्यश्च मैथिली । बद्धांजलिपुटाचेदमुवाचाग्निसमीपतः ॥",
                "चलनात्पर्वतेन्द्रस्य गणा देवाश्च कंपिताः। चचाल पार्वती चापि तदाश्लिष्टा महेश्वरम् ॥",
                "दाराः पुत्राः पुरं राष्ट्रं भोगाच्छादनभोजनम्। सर्वमेवाविभक्तं नौ भविष्यति हरीश्वर ॥",
                "यामेव रात्रिं शत्रुघ्नः पर्णशालां समाविशत्। तामेव रात्रिं सीतापि प्रसूता दारकद्वयम् ॥"};

        System.out.println("\n Down below are the Hindi characters taken from the first word of each 1000th shlokas");

        for (String input : input0) {
            String[] words = input.split(" ");

            if (words.length > 0) {
                String firstWord = words[0];
                if (!firstWord.isEmpty()) {
                    char firstLetter = firstWord.charAt(0);
                    System.out.print("\t"+firstLetter);
                }
            }
        }
        System.out.println("\n Now if we concatenate all the extracted Hindi Characters it will form");
        System.out.println("                          तत्सवितुर्वरॆण्यं\n" +
                "                        भर्गो देवस्य धीमहि\n" +
                "                       धियॊ यॊ नः प्रचोदयात्\n");
        System.out.println("Which is nothing but a Gayatri Mantra");
        System.out.println("                         (ॐ भूर्भुवः स्वः)\n" +
                "                          तत्सवितुर्वरेण्यं\n" +
                "                        भर्गो देवस्यः धीमहि\n" +
                "                      धियो यो नः प्रचोदयात् ॥");
    }
}
