import java.util.ArrayList;
import java.util.Scanner;
public class prashanavali {
    public static void main(String[] args) {
        String[][] mat = new String[15][15];
        System.out.print(" ");
        mat[0][0] = "   सु     ";
        mat[0][1] = "प्र   ";
        mat[0][2] = "उ    ";
        mat[0][3] = "बि   ";
        mat[0][4] = "हो   ";
        mat[0][5] = "मु   ";
        mat[0][6] = " ग    ";
        mat[0][7] = "ब    ";
        mat[0][8] = "सु   ";
        mat[0][9] = "नु   ";
        mat[0][10] = "बि   ";
        mat[0][11] = "घ    ";
        mat[0][12] = "धि    ";
        mat[0][13] = "इ    ";
        mat[0][14] = "द  \n  ";
        mat[1][0] = "र    ";
        mat[1][1] = " रू   ";
        mat[1][2] = "फ    ";
        mat[1][3] = "सि  ";
        mat[1][4] = " सि  ";
        mat[1][5] = "रहि   ";
        mat[1][6] = "बस   ";
        mat[1][7] = "हि    ";
        mat[1][8] = "मं   ";
        mat[1][9] = "ल   ";
        mat[1][10] = "न   ";
        mat[1][11] = "ल    ";
        mat[1][12] = "य     ";
        mat[1][13] = "न    ";
        mat[1][14] = "अं  \n  ";
        mat[2][0] = "सुज   ";
        mat[2][1] = "सो   ";
        mat[2][2] = "ग    ";
        mat[2][3] = "सु    ";
        mat[2][4] = "कु   ";
        mat[2][5] = "म    ";
        mat[2][6] = "स   ";
        mat[2][7] = "ग    ";
        mat[2][8] = "त   ";
        mat[2][9] = "न   ";
        mat[2][10] = " ई   ";
        mat[2][11] = "ल    ";
        mat[2][12] = "धा    ";
        mat[2][13] = "बे   ";
        mat[2][14] = " नो  \n  ";
        mat[3][0] = "त्य   ";
        mat[3][1] = "र    ";
        mat[3][2] = " न    ";
        mat[3][3] = "कु   ";
        mat[3][4] = "जो   ";
        mat[3][5] = "म    ";
        mat[3][6] = "रि   ";
        mat[3][7] = "र     ";
        mat[3][8] = "र   ";
        mat[3][9] = "अ   ";
        mat[3][10] = "की   ";
        mat[3][11] = "हो    ";
        mat[3][12] = "सं    ";
        mat[3][13] = "रा    ";
        mat[3][14] = "य  \n  ";
        mat[4][0] = "पु    ";
        mat[4][1] = "सु    ";
        mat[4][2] = "थ    ";
        mat[4][3] = "सी   ";
        mat[4][4] = "जे    ";
        mat[4][5] = "ड    ";
        mat[4][6] = "ग   ";
        mat[4][7] = "म    ";
        mat[4][8] = "सं   ";
        mat[4][9] = "क    ";
        mat[4][10] = "रे   ";
        mat[4][11] = "हो    ";
        mat[4][12] = "स    ";
        mat[4][13] = "स    ";
        mat[4][14] = "नि \n  ";
        mat[5][0] = "त    ";
        mat[5][1] = "र    ";
        mat[5][2] = "त     ";
        mat[5][3] = "र   ";
        mat[5][4] = "स    ";
        mat[5][5] = "हूँ    ";
        mat[5][6] = "ह    ";
        mat[5][7] = "ब    ";
        mat[5][8] = "ब   ";
        mat[5][9] = "प    ";
        mat[5][10] = "चि  ";
        mat[5][11] = "स     ";
        mat[5][12] = "हि    ";
        mat[5][13] = "स    ";
        mat[5][14] = "तु  \n  ";
        mat[6][0] = "म    ";
        mat[6][1] = "का  ";
        mat[6][2] = "ा     ";
        mat[6][3] = "र    ";
        mat[6][4] = "र    ";
        mat[6][5] = "म    ";
        mat[6][6] = "मि   ";
        mat[6][7] = "मी  ";
        mat[6][8] = "म्हा   ";
        mat[6][9] = "ा   ";
        mat[6][10] = "जा   ";
        mat[6][11] = "हू    ";
        mat[6][12] = "हीं    ";
        mat[6][13] = "ा    ";
        mat[6][14] = "ा\n  ";
        mat[7][0] = "ता   ";
        mat[7][1] = "रा    ";
        mat[7][2] = "रे     ";
        mat[7][3] = "री    ";
        mat[7][4] = "ह   ";
        mat[7][5] = "का    ";
        mat[7][6] = "फ   ";
        mat[7][7] = "खा   ";
        mat[7][8] = "जू    ";
        mat[7][9] = "ई   ";
        mat[7][10] = "र   ";
        mat[7][11] = "रा     ";
        mat[7][12] = "पू    ";
        mat[7][13] = "द    ";
        mat[7][14] = "ल \n  ";
        mat[8][0] = "नि   ";
        mat[8][1] = "को   ";
        mat[8][2] = "जो    ";
        mat[8][3] = "गो   ";
        mat[8][4] = "न    ";
        mat[8][5] = "मु    ";
        mat[8][6] = "जि   ";
        mat[8][7] = "यॅं    ";
        mat[8][8] = "ने  ";
        mat[8][9] = "मनि   ";
        mat[8][10] = "क   ";
        mat[8][11] = "ज    ";
        mat[8][12] = "प    ";
        mat[8][13] = "स    ";
        mat[8][14] = "ल \n  ";
        mat[9][0] = "हि   ";
        mat[9][1] = "रा    ";
        mat[9][2] = "मि    ";
        mat[9][3] = "स   ";
        mat[9][4] = "रि    ";
        mat[9][5] = "ग    ";
        mat[9][6] = "द   ";
        mat[9][7] = "न्मु    ";
        mat[9][8] = "ख   ";
        mat[9][9] = "म   ";
        mat[9][10] = "खि  ";
        mat[9][11] = "जि    ";
        mat[9][12] = "म    ";
        mat[9][13] = "त    ";
        mat[9][14] = "ज\n  ";
        mat[10][0] = "सि   ";
        mat[10][1] = "ख   ";
        mat[10][2] = "नु     ";
        mat[10][3] = "न   ";
        mat[10][4] = "कौ   ";
        mat[10][5] = "मि   ";
        mat[10][6] = "निज   ";
        mat[10][7] = "र्क    ";
        mat[10][8] = "ग   ";
        mat[10][9] = "धु    ";
        mat[10][10] = "ध  ";
        mat[10][11] = "सु    ";
        mat[10][12] = "का    ";
        mat[10][13] = "स    ";
        mat[10][14] = "र\n  ";
        mat[11][0] = "गु    ";
        mat[11][1] = "ब   ";
        mat[11][2] = "म     ";
        mat[11][3] = "अ   ";
        mat[11][4] = "रि   ";
        mat[11][5] = "नि    ";
        mat[11][6] = "म    ";
        mat[11][7] = "ल    ";
        mat[11][8] = "ा   ";
        mat[11][9] = "न    ";
        mat[11][10] = "ढॅं  ";
        mat[11][11] = "ती    ";
        mat[11][12] = "न    ";
        mat[11][13] = "क    ";
        mat[11][14] = "भ\n  ";
        mat[12][0] = "ना   ";
        mat[12][1] = "पु    ";
        mat[12][2] = "व    ";
        mat[12][3] = "अ    ";
        mat[12][4] = "ा    ";
        mat[12][5] = "र    ";
        mat[12][6] = "ल   ";
        mat[12][7] = "ा    ";
        mat[12][8] = "ए    ";
        mat[12][9] = "तु    ";
        mat[12][10] = "र   ";
        mat[12][11] = "न    ";
        mat[12][12] = "नु    ";
        mat[12][13] = "वै    ";
        mat[12][14] = "थ\n  ";
        mat[13][0] = "सि   ";
        mat[13][1] = "हूँ    ";
        mat[13][2] = "सु    ";
        mat[13][3] = "म्ह   ";
        mat[13][4] = "रा    ";
        mat[13][5] = "र    ";
        mat[13][6] = "स    ";
        mat[13][7] = "स   ";
        mat[13][8] = " र   ";
        mat[13][9] = "त    ";
        mat[13][10] = "न   ";
        mat[13][11] = "ख   ";
        mat[13][12] = "ा    ";
        mat[13][13] = "ज    ";
        mat[13][14] = "ा\n  ";
        mat[14][0] = "र   ";
        mat[14][1] = "ा    ";
        mat[14][2] = "ा    ";
        mat[14][3] = "ला   ";
        mat[14][4] = "धी   ";
        mat[14][5] = "ा    ";
        mat[14][6] = "री   ";
        mat[14][7] = "ा    ";
        mat[14][8] = "हू    ";
        mat[14][9] = "हीं   ";
        mat[14][10] = "खा   ";
        mat[14][11] = "जू    ";
        mat[14][12] = "ई    ";
        mat[14][13] = "रा    ";
        mat[14][14] = "रे\n  ";

        for (String[] strings : mat) {
            for (String string : strings) {
                System.out.print(string + " ");
                System.out.print(" ");
            }
        }
        System.out.println("Enter any value from 0 to 224");
        Scanner sc = new Scanner(System.in);
        ArrayList<String> l1 = new ArrayList<>();
        l1.add("सु");
        l1.add("प्र");
        l1.add("उ");
        l1.add("बि");
        l1.add("हो");
        l1.add("मु");
        l1.add("ग");
        l1.add("ब");
        l1.add("सु");
        l1.add("नु");
        l1.add("बि");
        l1.add("घ");
        l1.add("धि");
        l1.add("इ");
        l1.add("द");
        l1.add("र");
        l1.add("रू");
        l1.add("फ");
        l1.add("सि");
        l1.add("सि");
        l1.add("रहि");
        l1.add("बस");
        l1.add("हि");
        l1.add("मं");
        l1.add("ल");
        l1.add("न");
        l1.add("ल");
        l1.add("य");
        l1.add("न");
        l1.add("अं");
        l1.add("सुज");
        l1.add("सो");
        l1.add("ग");
        l1.add("सु");
        l1.add("कु");
        l1.add("म");
        l1.add("स");
        l1.add("ग");
        l1.add("त");
        l1.add("न");
        l1.add("ई");
        l1.add("ल");
        l1.add("धा");
        l1.add("बे");
        l1.add("नो");
        l1.add("त्य");
        l1.add("र");
        l1.add("न");
        l1.add("कु");
        l1.add("जो");
        l1.add("म");
        l1.add("रि");
        l1.add("र");
        l1.add("र");
        l1.add("अ");
        l1.add("की");
        l1.add("हो");
        l1.add("सं");
        l1.add("रा");
        l1.add("य");
        l1.add("पु");
        l1.add("सु");
        l1.add("थ");
        l1.add("सी");
        l1.add("जे");
        l1.add("ड");
        l1.add("ग");
        l1.add("म");
        l1.add("सं");
        l1.add("क");
        l1.add("रे");
        l1.add("हो");
        l1.add("स");
        l1.add("स");
        l1.add("नि");
        l1.add("त");
        l1.add("र");
        l1.add("त");
        l1.add("र");
        l1.add("स");
        l1.add("हूँ");
        l1.add("ह");
        l1.add("ब");
        l1.add("ब");
        l1.add("प");
        l1.add("चि");
        l1.add("स");
        l1.add("हि");
        l1.add("स");
        l1.add("तु");
        l1.add("म");
        l1.add("का");
        l1.add("ा");
        l1.add("र");
        l1.add("र");
        l1.add("म");
        l1.add("मि");
        l1.add("मी");
        l1.add("म्हा");
        l1.add("ा");
        l1.add("जा");
        l1.add("हू");
        l1.add("हीं");
        l1.add("ा");
        l1.add("ा");
        l1.add("ता");
        l1.add("रा");
        l1.add("रे");
        l1.add("री");
        l1.add("ह");
        l1.add("का");
        l1.add("फ");
        l1.add("खा");
        l1.add("जू");
        l1.add("ई");
        l1.add("र");
        l1.add("रा");
        l1.add("पू");
        l1.add("द");
        l1.add("ल");
        l1.add("नि");
        l1.add("को");
        l1.add("जो");
        l1.add("गो");
        l1.add("न");
        l1.add("मु");
        l1.add("जि");
        l1.add("यॅं");
        l1.add("ने");
        l1.add("मनि");
        l1.add("क");
        l1.add("ज");
        l1.add("प");
        l1.add("स");
        l1.add("ल");
        l1.add("हि");
        l1.add("रा");
        l1.add("मि");
        l1.add("स");
        l1.add("रि");
        l1.add("ग");
        l1.add("द");
        l1.add("न्मु");
        l1.add("ख");
        l1.add("म");
        l1.add("खि");
        l1.add("जि");
        l1.add("म");
        l1.add("त");
        l1.add("ज");
        l1.add("सि");
        l1.add("ख");
        l1.add("नु");
        l1.add("न");
        l1.add("कौ");
        l1.add("मि");
        l1.add("निज");
        l1.add("र्क");
        l1.add("ग");
        l1.add("धु");
        l1.add("ध");
        l1.add("सु");
        l1.add("का");
        l1.add("स");
        l1.add("र");
        l1.add("गु");
        l1.add("ब");
        l1.add("म");
        l1.add("अ");
        l1.add("रि");
        l1.add("नि");
        l1.add("म");
        l1.add("ल");
        l1.add("ा");
        l1.add("न");
        l1.add("ढॅं");
        l1.add("ती");
        l1.add("न");
        l1.add("क");
        l1.add("भ");
        l1.add("ना");
        l1.add("पु");
        l1.add("व");
        l1.add("अ");
        l1.add("ा");
        l1.add("र");
        l1.add("ल");
        l1.add("ा");
        l1.add("ए");
        l1.add("तु");
        l1.add("र");
        l1.add("न");
        l1.add("नु");
        l1.add("वै");
        l1.add("थ");
        l1.add("सि");
        l1.add("हूँ");
        l1.add("सु");
        l1.add("म्ह");
        l1.add("रा");
        l1.add("र");
        l1.add("स");
        l1.add("स");
        l1.add("र");
        l1.add("त");
        l1.add("न");
        l1.add("ख");
        l1.add("ा");
        l1.add("ज");
        l1.add("ा");
        l1.add("र");
        l1.add("ा");
        l1.add("ा");
        l1.add("ला");
        l1.add("धी");
        l1.add("ा");
        l1.add("री");
        l1.add("ा");
        l1.add("हू");
        l1.add("हीं");
        l1.add("खा");
        l1.add("जू");
        l1.add("ई");
        l1.add("रा");
        l1.add("रे");
        int x = sc.nextInt();
        int z, i, j, a;
        for (z = x; z <= 233; z = z + 9) {
            if (z >= 225) {
                break;
            } else {
                String y = l1.get(z);
                System.out.print(y);
                System.out.print(" ");
            }
        }
        switch (z) {
            case 225:
                for (z = 0; z <= x; z = z + 9) {
                    String y = l1.get(z);
                    System.out.print(y);
                    System.out.print(" ");
                }
                break;
            case 226:
                for (z = 1; z <= x; z = z + 9) {
                    String y = l1.get(z);
                    System.out.print(y);
                    System.out.print(" ");
                }
                break;
            case 227:
                for (z = 2; z <= x; z = z + 9) {
                    String y = l1.get(z);
                    System.out.print(y);
                    System.out.print(" ");
                }
                break;
            case 228:
                for (z = 3; z <= x; z = z + 9) {
                    String y = l1.get(z);
                    System.out.print(y);
                    System.out.print(" ");
                }
                break;
            case 229:
                for (z = 4; z <= x; z = z + 9) {
                    String y = l1.get(z);
                    System.out.print(y);
                    System.out.print(" ");
                }
                break;
            case 230:
                for (z = 5; z <= x; z = z + 9) {
                    String y = l1.get(z);
                    System.out.print(y);
                    System.out.print(" ");
                }
                break;
            case 231:
                for (z = 6; z <= x; z = z + 9) {
                    String y = l1.get(z);
                    System.out.print(y);
                    System.out.print(" ");
                }
                break;
            case 232:
                for (z = 7; z <= x; z = z + 9) {
                    String y = l1.get(z);
                    System.out.print(y);
                    System.out.print(" ");
                }
                break;
            case 233:
                for (z = 8; z <= x; z = z + 9) {
                    String y = l1.get(z);
                    System.out.print(y);
                    System.out.print(" ");
                }
                break;
            default:
                break;

        }
        System.out.println("\n");
        System.out.println("In which language did you want to get your answer\n Enter the index of language below\n");
        System.out.println("1.TELUGU\n2.KANNADA\n3.TAMIL\n4.HINDI\n5.MARATHI\n6.ENGLISH\n7.BANGALA\n8.Gujarati\n9.Assamese\n10.Malayalam\n");
        a = sc.nextInt();
        for (i = x; i >= 0; i = i - 9) {
            j = i;
            if (j < 9) {
                if (a == 1) {
                    switch (j) {
                        case 0 -> System.out.println("""
                                చాపై: మా నిజమైన ఆశీర్వాదాలు వినండి. నేను మీ హృదయాన్ని ఆరాధిస్తాను మరియు కోరుకుంటున్నాను.
                                పరిస్థితి: ఇది చౌపాయ్ బాల్కండ్‌లో సీతా జీకి గౌరీ జీ ఆశీర్వాదం.
                                ఫలితం: ప్రశ్న బాగుంది, పని నిరూపించబడుతుంది.
                                """);
                        case 1 -> System.out.println("""
                                చాపై: ప్రబీసీ నగర్ కీజే సబ్ కాజా. హృదయ రాఖీ కోసల్‌పూర్ రాజా ॥
                                పరిస్థితి: ఈ చౌపాయ్ సుందర్‌కాండ్‌లోని హనుమంతుడు లంకలోకి ప్రవేశించే సమయానికి చెందినది.
                                ఫలం: భగవన్నామాన్ని స్మరిస్తూనే కార్యాన్ని ప్రారంభించండి, విజయం లభిస్తుంది అని అర్థం.
                                """);
                        case 2 -> System.out.println("""
                                చాపై: ఉఘర్హి నహి హోగి నిబాహూ. కాలనేమి జిమ్మీ రావణ రాహూ ॥
                                పరిస్థితులు: ఈ చాపై చిన్నప్పటి నుంచి.
                                ఫలితం: పని విజయంపై సందేహం ఉంది.
                                """);
                        case 3 -> System.out.println("""
                                చాపై: బిధి కేవలం సుజన్ కుసంగత్ మీద ఉంది. ఫణి మణి సం నిజ గుఁ అనుసరాహీ ॥
                                పరిస్థితులు: ఈ చాపై చిన్నప్పటి నుంచి.
                                ఫలితం: చెడ్డవారి సహవాసాన్ని విడిచిపెట్టమని అర్థం.పని విజయంలో సందేహం.
                                """);
                        case 4 -> System.out.println("""
                                చాపై: హోఇహి సోఇ జో రామ్ రచీ రఖా. పని శాఖను పెంచండి.
                                పరిస్థితి: ఈ చౌపాయ్ బాల్కండ్ శివపార్వతి డైలాగ్‌లో ఉంది.
                                ఫలితం: పని పూర్తి చేయడంలో సందేహం ఉంది. భగవంతునికే వదిలేయండి.
                                """);
                        case 5 -> System.out.println("""
                                చాపాయి: మట్టి శుభప్రదమైన సాధు సమాజం. చరాచర తీర్థయాత్ర రాజు.
                                పరిస్థితులు: ఈ చాపై బాల్కండ్‌లోని సంత్ సమాజ్ రూపంలో తీర్థయాత్ర వర్ణనలో వస్తుంది.
                                ఫలం: పని విజయవంతం అవుతుందని అర్థం.
                                """);
                        case 6 -> System.out.println("""
                                చాపై: అమ్మాయి సుధా రిపు కర్హి మితై. గోపద్ సింధు అనల్ సిట్లై.
                                పరిస్థితి: ఈ చౌపాయ్ సుందర్‌కాండ్‌లోని హనుమాన్ జీ లంకలోకి ప్రవేశించిన సమయానికి చెందినది.
                                పండు: ప్రశ్న చాలా బాగుంది, పని విజయవంతం అవుతుంది.
                                """);
                        case 7 -> System.out.println("""
                                చాపై: బరున్ కుబేర్ సురేస్ సమీరా. మీరు ఎందుకు వేగాన్ని తగ్గించకూడదు అని ముఖాముఖిగా పరిగెత్తండి.
                                పరిస్థితి: రావణ సంహారంపై మండోదరి విలపించే సందర్భంలో ఈ చౌపాయ్ ఉంది.
                                ఫలితం: పని పూర్తి చేయడంలో సందేహం ఉంది.
                                """);
                        case 8 -> System.out.println("""
                                చాపై: నీకు విజయాన్ని కోరుకుంటున్నాను. రాము లఖను సుని హై సుఖరే ॥
                                పరిస్థితులు: ఈ చౌపాయ్ విశ్వామిత్రుని అనుగ్రహం.
                                ఫలితం: ప్రశ్న బాగుంది, పని నిరూపించబడుతుంది.
                                """);
                        default -> {
                        }
                    }
                } else if (a == 2) {
                    switch (j) {
                        case 0 -> System.out.println("""
                                ಚಾಪೈ: ನಮ್ಮ ನಿಜವಾದ ಆಶೀರ್ವಾದವನ್ನು ಆಲಿಸಿ. ನಾನು ನಿಮ್ಮ ಹೃದಯವನ್ನು ಆರಾಧಿಸುತ್ತೇನೆ ಮತ್ತು ಹಾರೈಸುತ್ತೇನೆ.
                                ಪರಿಸ್ಥಿತಿ: ಇದು ಚೌಪಾಯಿ ಬಾಲ್ಕಂಡ್‌ನಲ್ಲಿ ಸೀತಾಜಿಗೆ ಗೌರಿ ಜೀ ಆಶೀರ್ವಾದವಾಗಿದೆ.
                                ಫಲಿತಾಂಶ: ಪ್ರಶ್ನೆ ಒಳ್ಳೆಯದು, ಕೆಲಸವು ಸಾಬೀತಾಗುತ್ತದೆ.
                                """);
                        case 1 -> System.out.println("""
                                ಚಾಪೈ: ಪ್ರಬಿಸಿ ನಗರ ಕೀಜೆ ಸಬ್ ಕಾಜಾ. ಹೃದಯ ರಾಖಿ ಕೋಸಲ್ಪುರ್ ರಾಜಾ ॥
                                ಪರಿಸ್ಥಿತಿ: ಈ ಚೌಪೈ ಸುಂದರ್‌ಕಾಂಡ್‌ನಲ್ಲಿ ಹನುಮಾನ್ ಜಿ ಲಂಕಾಕ್ಕೆ ಪ್ರವೇಶಿಸಿದ ಸಮಯ.
                                ಫಲ: ದೇವರ ನಾಮಸ್ಮರಣೆ ಮಾಡುತ್ತಲೇ ಕೆಲಸ ಆರಂಭಿಸಿದರೆ ಯಶಸ್ಸು ಸಿಗುತ್ತದೆ ಎಂಬುದು ಅರ್ಥ.
                                """);
                        case 2 -> System.out.println("""
                                ಚಾಪೈ : ಉಘರ್ಹಿ ನಹಿ ಹೋಗೀ ನಿಬಾಹು। ಕಾಲನೇಮಿ ಜಿಮ್ಮಿ ರಾವಣ ರಾಹು ॥
                                ಸಂದರ್ಭಗಳು: ಈ ಚಪ್ಪಾಯಿ ಬಾಲ್ಯದ ಆರಂಭದಿಂದಲೂ.
                                ಫಲಿತಾಂಶ: ಕೆಲಸದ ಯಶಸ್ಸಿನಲ್ಲಿ ಅನುಮಾನವಿದೆ.
                                """);
                        case 3 -> System.out.println("""
                                ಚಾಪೈ: ಬಿಧಿ ಕೇವಲ ಸುಜನ್ ಕುಸಂಗತ್ ಮೇಲೆ. ಫನಿ ಮನಿ ಸಂ ನಿಜ ಗುನ ಅನುಸರಾಹೀ ॥
                                ಸಂದರ್ಭಗಳು: ಈ ಚಪ್ಪಾಯಿ ಬಾಲ್ಯದ ಆರಂಭದಿಂದಲೂ.
                                ಫಲಿತಾಂಶ: ಕೆಟ್ಟವರ ಸಹವಾಸವನ್ನು ಬಿಟ್ಟುಬಿಡಿ ಎಂದು ಅರ್ಥ.ಕೆಲಸದ ಯಶಸ್ಸಿನಲ್ಲಿ ಅನುಮಾನವಿದೆ.
                                """);
                        case 4 -> System.out.println("""
                                ಚಾಪೈ: ಹೋಇಹಿ ಸೋಇ ಜೋ ರಾಮ್ ರಚಿ ರಾಖಾ. ಕೆಲಸದ ಶಾಖೆಯನ್ನು ಹೆಚ್ಚಿಸಿ.
                                ಪರಿಸ್ಥಿತಿ: ಈ ಚೌಪಾಯಿ ಬಾಲ್ಕಂಡ್ ಶಿವ ಪಾರ್ವತಿ ಸಂಭಾಷಣೆಯಲ್ಲಿದೆ.
                                ಫಲಿತಾಂಶ: ಕಾಮಗಾರಿ ಪೂರ್ಣಗೊಳ್ಳುವುದು ಅನುಮಾನ. ಅದನ್ನು ಭಗವಂತನಿಗೆ ಬಿಡಿ.
                                """);
                        case 5 -> System.out.println("""
                                ಚಾಪಾಯಿ: ಮಣ್ಣಿನ ಮಂಗಳಕರ ಸಂತ ಸಮಾಜ. ಜಂಗಮ ತೀರ್ಥ ರಾಜು ಜಗತ್ತು.
                                ಸಂದರ್ಭಗಳು: ಈ ಚಾಪೈ ಬಾಲ್ಕಂಡ್‌ನ ಸಂತ ಸಮಾಜದ ರೂಪದಲ್ಲಿ ತೀರ್ಥಯಾತ್ರೆಯ ವಿವರಣೆಯಲ್ಲಿ ಬರುತ್ತದೆ.
                                ಫಲ: ಕೆಲಸವು ಯಶಸ್ವಿಯಾಗುತ್ತದೆ ಎಂದರ್ಥ.
                                """);
                        case 6 -> System.out.println("""
                                ಚಾಪೈ : ಹುಡುಗಿ ಸುಧಾ ರಿಪು ಕರ್ಹಿ ಮಿತಾಈ। ಗೋಪಾದ ಸಿಂಧು ಅನಲ್ ಸಿತ್ಲೈ.
                                ಪರಿಸ್ಥಿತಿ: ಈ ಚೌಪೈ ಸುಂದರ್‌ಕಾಂಡ್‌ನಲ್ಲಿ ಹನುಮಾನ್ ಜಿ ಲಂಕಾವನ್ನು ಪ್ರವೇಶಿಸುವ ಸಮಯದದ್ದಾಗಿದೆ.
                                ಫಲ: ಪ್ರಶ್ನೆ ತುಂಬಾ ಒಳ್ಳೆಯದು, ಕೆಲಸವು ಯಶಸ್ವಿಯಾಗುತ್ತದೆ.
                                """);
                        case 7 -> System.out.println("""
                                ಚಾಪೈ: ಬರುನ್ ಕುಬೇರ್ ಸುರೇಸ್ ಸಮೀರ. ಓಡಿ ಮುಖಾಮುಖಿ ಯಾಕೆ ನಿಧಾನ ಮಾಡಬಾರದು.
                                ಸನ್ನಿವೇಶ: ಈ ಚೌಪಾಯಿಯು ರಾವಣನ ಸಂಹಾರದ ಬಗ್ಗೆ ಮಂಡೋದರಿಯ ಪ್ರಲಾಪದ ಸನ್ನಿವೇಶದಲ್ಲಿದೆ.
                                ಫಲಿತಾಂಶ: ಕಾಮಗಾರಿ ಪೂರ್ಣಗೊಳ್ಳುವುದು ಅನುಮಾನ.
                                """);
                        case 8 -> System.out.println("""
                                ಚಾಪೈ: ನಾನು ನಿಮಗೆ ಯಶಸ್ಸನ್ನು ಬಯಸುತ್ತೇನೆ. ರಾಮು ಲಖನು ಸುನಿ ಹೈ ಸುಖರೇ ॥
                                ಸಂದರ್ಭಗಳು: ಈ ಚೌಪಾಯಿ ವಿಶ್ವಾಮಿತ್ರನ ಆಶೀರ್ವಾದ.
                                ಫಲಿತಾಂಶ: ಪ್ರಶ್ನೆ ಒಳ್ಳೆಯದು, ಕೆಲಸವು ಸಾಬೀತಾಗುತ್ತದೆ.
                                """);
                        default -> {
                        }
                    }
                } else if (a==3) {
                    switch (j) {
                        case 0 -> System.out.println("""
                                சாப்பாய்: எங்கள் உண்மையான ஆசீர்வாதங்களைக் கேளுங்கள். நான் உங்கள் இதயத்தை வணங்குகிறேன் மற்றும் விரும்புகிறேன்.
                                சூழ்நிலை: இது சௌபாய் பால்கண்டில் சீதா ஜிக்கு கௌரியின் ஆசீர்வாதம்.
                                முடிவு: கேள்வி நல்லது, வேலை நிரூபிக்கப்படும்.
                                """);
                        case 1 -> System.out.println("""
                                சாபை: பிரபிஸி நகர் கிஜே சப் காஜா. ஹார்ட் ராகி கோசல்பூர் ராஜா ॥
                                சூழ்நிலை: இந்த சௌபாய், சுந்தர்கண்டில் ஹனுமான் ஜி இலங்கைக்குள் நுழைந்த காலத்தைச் சேர்ந்தது.
                                பழம்: கடவுளின் திருநாமத்தை நினைத்துக் கொண்டே வேலையைத் தொடங்கினால் வெற்றி கிடைக்கும் என்பது பொருள்.
                                """);
                        case 2 -> System.out.println("""
                                சாபை: உகர்ஹி நஹி ஹோகி நிபாஹு. காலநேமி ஜிம்மி ராவண ராஹு ॥
                                சூழ்நிலைகள்: இந்த சப்பை குழந்தை பருவத்தில் இருந்து.
                                முடிவு: வேலை வெற்றியில் சந்தேகம் உள்ளது.
                                """);
                        case 3 -> System.out.println("""
                                சாபாய்: பிதி சுஜன் குசங்கத்தில் தான் உள்ளது. ஃபாநி மாநி ஸம் நிஜ் கன் அனுசராஹி ॥
                                சூழ்நிலைகள்: இந்த சப்பை குழந்தை பருவத்தில் இருந்து.
                                முடிவு: கெட்டவர்களின் சகவாசத்தை விட்டுவிடுங்கள் என்பது பொருள்.செயல் வெற்றியில் சந்தேகம்.
                                """);
                        case 4 -> System.out.println("""
                                சாபை: ஹோய்ஹி சோஇ ஜோ ராம் ரசி ரகா. வேலையின் கிளையை அதிகரிக்கவும்.
                                சூழ்நிலை: இந்த சௌபாய் பால்கண்ட் சிவ பார்வதி உரையாடலில் உள்ளது.
                                முடிவு: பணி முடிவதில் சந்தேகம் உள்ளது. இறைவனிடம் விட்டுவிடு.
                                """);
                        case 5 -> System.out.println("""
                                சாப்பை: சேற்று மங்களகரமான புனித சமுதாயம். அசையும் யாத்திரை ராஜு இது உலகம்.
                                சூழ்நிலைகள்: இந்த சப்பை பால்கண்டில் உள்ள சந்த் சமாஜ் வடிவத்தில் புனித யாத்திரையின் விளக்கத்தில் வருகிறது.
                                பலன்: காரியம் வெற்றியடையும் என்று அர்த்தம்.
                                """);
                        case 6 -> System.out.println("""
                                சாபை: கேர்ள் சுதா ரிபு கர்ஹி மிதாய். கோபட் சிந்து அனல் சிட்லை.
                                சூழ்நிலை: இந்த சௌபாய், சுந்தர்கண்டில் ஹனுமான் ஜி இலங்கைக்குள் நுழைந்த காலத்தைச் சேர்ந்தது.
                                பழ: கேள்வி மிகவும் நல்லது, வேலை வெற்றியடையும்.
                                """);
                        case 7 -> System.out.println("""
                                சாப்பை: பாருன் குபேர் சுரேஸ் சமீரா. நேருக்கு நேர் ஏன் வேகத்தைக் குறைக்கக் கூடாது.
                                சூழ்நிலை: இந்த சௌபை ராவணனை வதம் செய்த மண்டோதரியின் புலம்பல் பின்னணியில் உள்ளது.
                                முடிவு: பணி முடிவதில் சந்தேகம் உள்ளது.
                                """);
                        case 8 -> System.out.println("""
                                சாப்பாய்: வெற்றி பெற வாழ்த்துகிறேன். ராமு லகாநு ஸுநி ஹை ஸுகரே ॥
                                சூழ்நிலைகள்: இந்த சௌபை விஸ்வாமித்திரரின் ஆசீர்வாதம்.
                                முடிவு: கேள்வி நல்லது, வேலை நிரூபிக்கப்படும்.
                                """);
                        default -> {
                        }
                    }
                } else if (a==4) {
                    switch (j) {
                        case 0 -> System.out.println("""
                                चौपाई :\tसुनु सिय सत्य असीस हमारी। पूजहि मन कामना तुम्हारी॥
                                परिस्थिति :\tयह चौपाई बालकाण्ड मे सीता जी को गौरी जी का आशिर्वाद है।
                                फल :\tप्रश्न उत्तम है कार्य सिद्ध होगा।
                                """);
                        case 1 -> System.out.println("""
                                चौपाई :\tप्रबिसि नगर कीजे सब काजा। हृदय राखि कोसलपुर राजा॥
                                परिस्थिति :\tयह चौपाई सुन्दरकाण्ड मे हनुमान जी के लंका मे प्रवेश करने के समय की है।
                                फल :\tअर्थ यह है कि भगवान के नाम का स्मरण करते हुये कार्य शुरू करें सफलता मिलेगी।
                                """);
                        case 2 -> System.out.println("""
                                चौपाई :\tउघरहिं अंत न होइ निबाहू। कालनेमि जिमि रावन राहू॥
                                परिस्थिति :\tयह चौपाई बालकाण्ड के आरम्भ की है।
                                फल :\tकार्य की सफलता मे संदेह है।
                                """);
                        case 3 -> System.out.println("""
                                चौपाई :\tबिधि बस सुजन कुसंगत परहीं। फनि मनि सम निज गुन अनुसरहीं॥
                                परिस्थिति :\tयह चौपाई बालकाण्ड के आरम्भ की है। 
                                फल :\tअर्थ यह है कि बुरे लोगों का संग छोड़ दें कार्य की सफलता मे संदेह है।
                                """);
                        case 4 -> System.out.println("""
                                चौपाई :\tहोइहि सोइ जो राम रचि राखा। को करितर्क बढ़ावै साखा॥
                                परिस्थिति :\tयह चौपाई बालकाण्ड शिव पार्वती संवाद मे है।
                                फल :\tकार्य पूरा होने मे संदेह है। प्रभु पर छोड़ दें।
                                """);
                        case 5 -> System.out.println("""
                                चौपाई :\tमुद मंगलमय संत समाजू। जो जग जंगम तीरथ राजू॥
                                परिस्थिति :\tयह चौपाई बालकाण्ड मे संत समाजरुपी तीर्थ वर्णन मे आती है।
                                फल :\tअर्थ यह है कि कार्य सिद्ध होगा।
                                """);
                        case 6 -> System.out.println("""
                                चौपाई :\tगरल सुधा रिपु करहिं मिताई। गोपद सिंधु अनल सितलाई॥
                                परिस्थिति :\tयह चौपाई सुन्दरकाण्ड मे हनुमान जी के लंका मे प्रवेश करने के समय की है।
                                फल :\tप्रश्न बहुत श्रेष्ठ है कार्य सिद्ध होगा।
                                """);
                        case 7 -> System.out.println("""
                                चौपाई :\tबरुन कुबेर सुरेस समीरा। रन सन्मुखधरि काहु न धीरा॥
                                परिस्थिति :\tयह चौपाई रावण वध पर मंदोदरी के विलाप के संदर्भ मे है।
                                फल :\tकार्य पूरा होने मे संदेह है।
                                """);
                        case 8 -> System.out.println("""
                                चौपाई :\tसुफल मनोरथ हो हुँ तुम्हारे। रामु लखनु सुनि भए सुखारे॥
                                परिस्थिति :\tयह चौपाई विश्वामित्र का आशिर्वाद है।
                                फल :\tप्रश्न उत्तम है कार्य सिद्ध होगा।
                                """);
                        default -> {
                        }
                    }
                } else if (a==5) {
                    switch (j) {
                        case 0 -> System.out.println("""
                                चपाई: आमचे खरे आशीर्वाद ऐका. मी तुझी मनोभावे पूजा करतो.
                                स्थिती: चौपई बालकांडात गौरीजींनी सीताजींना दिलेला आशीर्वाद आहे.
                                परिणाम: प्रश्न चांगला आहे, काम सिद्ध होईल.
                                """);
                        case 1 -> System.out.println("""
                                चापई: प्रबिसी नगर कीजे सब काजा। हृदय राखी कोसलपूर राजा ॥
                                परिस्थिती: ही चौपई हनुमानजींनी सुंदरकांडमध्ये लंकेत प्रवेश केल्याच्या काळातील आहे.
                                फल: तात्पर्य म्हणजे भगवंताचे नामस्मरण करतच कामाला सुरुवात करा, यश मिळेल.
                                """);
                        case 2 -> System.out.println("""
                                चपाई : उघरी नाही होणार निबाहू. कालनेमि जिमी रावण राहू ॥
                                परिस्थिती: ही चपई लहानपणापासूनची आहे.
                                परिणाम: कामाच्या यशाबद्दल शंका आहे.
                                """);
                        case 3 -> System.out.println("""
                                चपई: बिधी फक्त सुजन कुसंगत वर आहे. फणी मनीं सम निज गुण अनुसरही ॥
                                परिस्थिती: ही चपई लहानपणापासूनची आहे.
                                परिणाम: अर्थ असा आहे की वाईट लोकांची संगत सोडा.कामाच्या यशात शंका आहे.
                                """);
                        case 4 -> System.out.println("""
                                चपाई : होइही सोई जो राम रचि राखा । कामाची शाखा वाढवा.
                                स्थिती: ही चौपई बालकांड शिवपार्वती संवादात आहे.
                                परिणाम: काम पूर्ण होण्याबाबत शंका आहे. परमेश्वरावर सोडा.
                                """);
                        case 5 -> System.out.println("""
                                चापई : माती शुभ संत समाज. संसार जो जंगम तीर्थ राजु ।
                                परिस्थिती: ही चपई बालखंडातील संत समाजाच्या रूपाने तीर्थक्षेत्राच्या वर्णनात येते.
                                फळ : म्हणजे कामात यश मिळेल.
                                """);
                        case 6 -> System.out.println("""
                                चपाई : मुलगी सुधा रिपु करही मिताई । गोपद सिंधु अनल सीतलाय ।
                                परिस्थिती: ही चौपई सुंदरकांडमध्ये हनुमानजींच्या लंकेत प्रवेशाच्या वेळची आहे.
                                फळ : प्रश्न खूप चांगला आहे, कामात यश मिळेल.
                                """);
                        case 7 -> System.out.println("""
                                चापई : बरुण कुबेर सुरे समीरा. समोरासमोर धावा तुम्ही हळू का करत नाही.
                                स्थिती: ही चौपई रावणाच्या वधावर मंदोदरीच्या विलापाच्या संदर्भात आहे.
                                परिणाम: काम पूर्ण होण्याबाबत शंका आहे.
                                """);
                        case 8 -> System.out.println("""
                                चपाई: मी तुम्हाला यशाची शुभेच्छा देतो. रामु लखनु सुनी हे सुखरे ॥
                                परिस्थिती: ही चौपई विश्वामित्राचा आशीर्वाद आहे.
                                परिणाम: प्रश्न चांगला आहे, काम सिद्ध होईल.
                                """);
                        default -> {
                        }
                    }
                } else if (a==6) {
                    switch (j) {
                        case 0 -> System.out.println("""
                                Chaupai: Listen to our true blessings. I worship your heart and wish.
                                Situation: This is the blessing of Gauri ji to Sita ji in the Chaupai Balkand.
                                Result: The question is good, the work will be proved.
                                """);
                        case 1 -> System.out.println("""
                                Chapai: Prabisi Nagar kije sab kaja. Heart Rakhi Kosalpur Raja ॥
                                Situation: This chaupai is of the time of Hanuman ji entering Lanka in Sunderkand.
                                Fruit: The meaning is that start the work while remembering the name of God, you will get success.
                                """);
                        case 2 -> System.out.println("""
                                Chapai: Ugharhi nahi hogi nibahu. Kalnemi Jimmy Ravan Rahu ॥
                                Circumstances: This chapai is from the beginning of childhood.
                                Result: There is doubt in the success of the work.
                                """);
                        case 3 -> System.out.println("""
                                Chapai: Bidhi is just on Sujan Kusangat. Fani Mani Sam Nij Gun Anusarahi ॥
                                Circumstances: This chapai is from the beginning of childhood.
                                Result: The meaning is that leave the company of bad people. There is doubt in the success of the work.
                                """);
                        case 4 -> System.out.println("""
                                Chapai: Hoihi soi jo Ram Rachi Rakha. Increase the branch of work.
                                Situation: This chaupai balkand is in Shiv Parvati dialogue.
                                Result: There is doubt in the completion of the work. Leave it to the Lord.
                                """);
                        case 5 -> System.out.println("""
                                Chapai: Mud auspicious saint society. The world which is movable pilgrimage Raju.
                                Circumstances: This chapai comes in the description of pilgrimage in the form of Sant Samaj in Balkand.
                                Fruit: It means that the work will be successful.
                                """);
                        case 6 -> System.out.println("""
                                Chapai: Girl Sudha Ripu Karhi Mitai. Gopad Sindhu Anal Sitlai.
                                Situation: This chaupai is of the time of Hanuman ji entering Lanka in Sunderkand.
                                Fruit: The question is very good, the work will be successful.
                                """);
                        case 7 -> System.out.println("""
                                Chapai: Barun Kuber Sures Sameera. Run face to face why don't you slow down.
                                Situation: This chaupai is in the context of Mandodari's lamentation on Ravana's slaughter.
                                Result: There is doubt in the completion of the work.
                                """);
                        case 8 -> System.out.println("""
                                Chapai: I wish you success. Ramu Lakhanu Suni Hai Sukhare ॥
                                Circumstances: This chaupai is the blessing of Vishwamitra.
                                Result: The question is good, the work will be proved.
                                """);
                        default -> {
                        }
                    }
                }else if (a==7) {
                    switch (j) {
                        case 0 -> System.out.println("""
                                চাপাই: আমাদের সত্যিকারের আশীর্বাদ শুনুন। আমি আপনার হৃদয় এবং ইচ্ছা পূজা.
                                পরিস্থিতি: চৌপাই বলকাণ্ডে সীতাজীর প্রতি গৌরী জির এই আশীর্বাদ।
                                ফলাফল: প্রশ্ন ভাল, কাজ প্রমাণ হবে।
                                """);
                        case 1 -> System.out.println("""
                                চাপাইঃ প্রবিসি নগর কিজে সব কাজা। হৃদয় রাখি কোসলপুর রাজা ॥
                                পরিস্থিতি: এই চৌপাই সুন্দরকাণ্ডে হনুমানজির লঙ্কায় প্রবেশের সময়কার।
                                ফলঃ অর্থঃ ভগবানের নাম স্মরণ করে কাজ শুরু করুন, সফলতা পাবেন।
                                """);
                        case 2 -> System.out.println("""
                                চাপাই উঘরহি নাহি হোগি নিবাহু৷ কালনেমি জিমি রাবন রাহু ॥
                                পরিস্থিতি: এই চাপাই শৈশব থেকে শুরু করে।
                                ফলাফল: কাজের সাফল্যে সন্দেহ আছে।
                                """);
                        case 3 -> System.out.println("""
                                 চাঁপাইঃ বিধি শুধু সুজন কুসংগতে। ফণী মানি সম নিজ গুন অনুসারহি ॥
                                পরিস্থিতি: এই চাপাই শৈশব থেকে শুরু করে।
                                ফলাফলঃ অর্থঃ খারাপ লোকের সঙ্গ ত্যাগ কর।কাজের সফলতায় সন্দেহ আছে।
                                """);
                        case 4 -> System.out.println("""
                                চাপাইঃ হোইহি সোই জো রাম রচি রাখা। কাজের শাখা বাড়ান।
                                পরিস্থিতি: শিব পার্বতী সংলাপে এই চৌপাই বলকাণ্ড।
                                ফলাফল: কাজ সমাপ্তিতে সন্দেহ আছে। প্রভুর উপর ছেড়ে দিন।
                                """);
                        case 5 -> System.out.println("""
                                চাপাইঃ মাটি শুভ সাধু সমাজ। জগৎ যা চলন্ত তীর্থ রাজু।
                                পরিস্থিতি: এই চাপাই বলকান্দের সন্তসমাজের আকারে তীর্থযাত্রার বর্ণনায় এসেছে।
                                ফল: এর অর্থ হল কাজ সফল হবে।
                                """);
                        case 6 -> System.out.println("""
                                চাপাইঃ মেয়ে সুধা রিপু করহি মিতাই। গোপদ সিন্ধু অনল সিতলাই।
                                পরিস্থিতি: এই চৌপাই সুন্দরকাণ্ডে হনুমানজির লঙ্কায় প্রবেশের সময়কার।
                                ফল: প্রশ্ন খুব ভাল, কাজ সফল হবে।
                                """);
                        case 7 -> System.out.println("""
                                চাপাই: বরুন কুবের সুরেশ সমীরা। সামনাসামনি দৌড়াও কেন তুমি ধীর কর না।
                                পরিস্থিতি: এই চৌপাইটি রাবণ বধে মন্দোদরীর বিলাপের প্রসঙ্গে।
                                ফলাফল: কাজ সমাপ্তিতে সন্দেহ আছে।
                                """);
                        case 8 -> System.out.println("""
                                চাপাই: আমি আপনার সাফল্য কামনা করি। রামু লাখানু সুনি হ্যায় সুখরে ॥
                                পরিস্থিতি: এই চৌপাই বিশ্বামিত্রের আশীর্বাদ।
                                ফলাফল: প্রশ্ন ভাল, কাজ প্রমাণ হবে।
                                """);
                        default -> {
                        }
                    }
                }
            }
        }
    }
}



